<?php
use Sci\Math\NeuralNetwork\Kohonen as Machine;

$DataSet1 = $Db->SqlAssocRecordset("
    SELECT id,region,round(time/60) `time`,round(download/(1024*1024)) `download`,round(upload/(1024*1024)) `upload`,num_visits,list_visits
    FROM data.data_set_1;",function($r,&$rs){

    $vi = [$r['time'],$r['download'],$r['upload'],$r['num_visits'],0,$r['region'],$r['id']];

        $Visits = explode(',',$r['list_visits']);
        $first = reset($Visits);

        for($i=1;$i<count($Visits);$i++) {
            $period = $Visits[$i] - $first;
            $first = $Visits[$i];
            $vi[4] += $period;
        }
        $vi[4] /= count($Visits);
        $rs[] = $vi;
    });

//var_export($DataSet1);

$DataSet =[
    [1.00,1.00,0.17,0.78,0.70,0.77,0.68],
    [1.00,0.00,0.17,0.58,0.35,0.00,0.00],
    [0.00,0.00,0.17,0.58,0.35,0.70,0.60],
    [1.00,1.00,1.00,0.77,0.84,0.75,1.00],
    [0.00,1.00,0.33,0.77,0.70,0.71,0.71],
    [0.00,1.00,0.17,0.77,0.90,0.87,0.63],
    [0.00,1.00,0.00,0.78,0.65,0.74,0.81],
    [1.00,0.00,0.00,0.52,0.58,0.59,0.63],
    [1.00,0.00,0.00,0.57,0.24,0.68,0.49],
    [1.00,0.00,0.17,0.52,0.35,0.13,0.00],
    [0.00,1.00,1.00,0.90,0.99,1.00,1.00],
    [0.00,1.00,0.17,0.89,0.88,0.70,0.63],
    [1.00,0.00,0.00,0.61,0.00,0.05,0.49],
    [0.00,1.00,0.83,0.83,0.72,0.77,0.81],
    [1.00,0.00,0.00,0.00,0.03,0.03,0.49],
    [0.00,1.00,0.17,0.65,0.66,0.68,0.49],
    [1.00,1.00,0.67,1.00,1.00,0.89,1.00],
    [0.00,1.00,1.00,0.85,0.94,0.92,0.81],
    [1.00,1.00,0.83,0.52,0.58,0.74,0.49],
    [1.00,0.00,0.00,0.57,0.35,0.03,0.63],
];

$Data = [
    [1,'Варданян','М','Да',60,79,60,72,63,1.00],
    [2,'Горбунов','М','Нет',60,61,30,5,17,0.00],
    [3,'Гуменюк','Ж','Нет',60,61,30,66,58,0.00],
    [4,'Егоров','М','Да',85,78,72,70,85,1.25],
    [5,'Захарова','Ж','Да',65,78,60,67,65,1.00],
    [6,'Иванова','Ж','Да',60,78,77,81,60,1.25],
    [7,'Ишонина','Ж','Да',55,79,56,69,72,0.00],
    [8,'Климчук','М','Нет',55,56,50,56,60,0.00],
    [9,'Лисовский','М','Нет',55,60,21,64,50,0.00],
    [10,'Нетреба','М','Нет',60,56,30,16,17,0.00],
    [11,'Остапова','Ж','Да',85,89,85,92,85,1.75],
    [12,'Пашкова','Ж','Да',60,88,76,66,60,1.25],
    [13,'Попов','М','Нет',55,64,0,9,50,0.00],
    [14,'Сазон','Ж','Да',80,83,62,72,72,1.25],
    [15,'Степоненко','М','Нет',55,10,3,8,50,0.00],
    [16,'Терентьева','Ж','Да',60,67,57,64,50,0.00],
    [17,'Титов','М','Да',75,98,86,82,85,1.50],
    [18,'Чернова','Ж','Да',85,85,81,85,72,1.25],
    [19,'Четкин','М','Да',80,56,50,69,50,0.00],
    [20,'Шевченко','М','Нет',55,60,30,8,60,0.00],
];

$nn = new Machine(7,4,[
    /* w11 */0.20,   /* w21 */0.20,   /* w31 */0.30,   /* w41 */0.40,   /* w51 */0.40,   /* w61 */0.20,   /* w71 */0.50,
    /* w12 */0.20,   /* w22 */0.80,   /* w32 */0.70,   /* w42 */0.80,   /* w52 */0.70,   /* w62 */0.70,   /* w72 */0.80,
    /* w13 */0.80,   /* w23 */0.20,   /* w33 */0.50,   /* w43 */0.50,   /* w53 */0.40,   /* w63 */0.40,   /* w73 */0.40,
    /* w14 */0.80,   /* w24 */0.80,   /* w34 */0.60,   /* w44 */0.70,   /* w54 */0.70,   /* w64 */0.60,   /* w74 */0.70,
]);

$nn->Training(function($n,$epoch,$nn)use(&$DataSet){
    return $DataSet[$n];
},count($DataSet),0.30,0.01);

$R = [];
$Gr = [];

foreach($DataSet as $n=>$i) {
    $c = $nn->Cluster($i,$Clusters);
    $R[$c][] = $n+1;
    $Gr[$c]['Пол'][] = $Data[$n][2];
    $Gr[$c]['Все сдано'][] = $Data[$n][3];
    !isset($Gr[$c]['Средний бал']) && $Gr[$c]['Средний бал'] = 0.0;
    !isset($Gr[$c]['Коэф. степендии']) && $Gr[$c]['Коэф. степендии'] = 0.0;
    $Gr[$c]['Средний бал'] += ($Data[$n][4] + $Data[$n][5] + $Data[$n][6] + $Data[$n][7] + $Data[$n][8]) / 5;
    $Gr[$c]['Коэф. степендии'] += $Data[$n][9];
}

foreach($Gr as $c=>$D) {
    $cnt = count($R[$c]);
    printf ("Кластер №%d [размер=%d, пол=(%s), сданы все зачеты=(%s), средний балл=%d, коэф. стипендии=(%.2f)<br>",
        $c,$cnt,implode(', ',array_unique($D['Пол'])),implode(', ',array_unique($D['Все сдано'])),$D['Средний бал']/$cnt,$D['Коэф. степендии']/$cnt );
}

printJson($R);
/*
 *
$WNames = ['N{|epoch}','Err{|MSE}','N{|neurons}','N{|weights}','N{|inputs}','N{|outputs}',];

foreach(($W = $nn->getWeights()) as $k=>$w) {
    $WNames[] = "w{|$k}";
}

$O = [];
$R = [];

foreach($DataSet as list($i,$o)) {
    $O[] = $o;
    $R[] = $nn->Compute($i,3.0);
}

printTable('Dataset',$WNames,[[$nn->NumEpoch,$nn->MSE,$nn->NumNeurons,$nn->NumWeights,$nn->NumInputs,$nn->NumOutputs]],[$W]);

printTable('Dataset',[
    'O{|1}','O{|2}','~Y{|1}','~Y{|2}',
],$O,$R);

*/